config.org
#+TITLE: Emacs Configuration
#+AUTHOR: Clement NICOLAS
#+EMAIL: niccle27@gmail.com

* Table of Contents :TOC:
- [[#to-sort-later][To Sort Later]]
- [[#acknowledgement][Acknowledgement]]
  - [[#noteworthy-configurations][Noteworthy configurations]]
- [[#before-startup][Before Startup]]
  - [[#refresh-packages][Refresh packages]]
  - [[#define-repos][Define repos]]
  - [[#install-use-package][Install use-package]]
- [[#general][General]]
  - [[#better-defaults][Better defaults]]
  - [[#navigation][Navigation]]
  - [[#edition][Edition]]
  - [[#customization][Customization]]
  - [[#fonts][Fonts]]
  - [[#theme][Theme]]
  - [[#lsp][LSP]]
  - [[#typing][Typing]]
  - [[#interface-enhancement][Interface Enhancement]]
  - [[#projects][Projects]]
  - [[#file-manager][File Manager]]
- [[#programming-languages][Programming languages]]
  - [[#general-programming-settings][General programming settings]]
  - [[#web-mode][Web-mode]]
  - [[#emmet-mode][Emmet-mode]]
  - [[#linters][Linters]]
- [[#org-mode][Org-Mode]]
- [[#advanced-configurations][Advanced configurations]]
  - [[#alert][Alert]]
  - [[#auto-completion][Auto-Completion]]
  - [[#external-launch][External Launch]]
  - [[#buffer][Buffer]]
  - [[#calculator][Calculator]]
  - [[#dashboard][Dashboard]]
  - [[#dired][Dired]]
  - [[#history][History]]
  - [[#hydra][Hydra]]
  - [[#draw-graphics][Draw graphics]]
  - [[#try][Try]]
  - [[#undo-tree][Undo-tree]]
  - [[#wiki-summary][Wiki-summary]]
  - [[#irc][IRC]]
  - [[#recent-files][Recent Files]]
  - [[#revealjs][Reveal.js]]

* To Sort Later

#+begin_src emacs-lisp
(defun copy-filename ()
  "Copy the current buffer file name to the clipboard."
  (interactive)
  (let ((filename (if (equal major-mode 'dired-mode)
                      default-directory
                    (buffer-file-name))))
    (when filename
      (kill-new filename)
      (message "Copied buffer file name '%s' to the clipboard." filename))))
#+end_src

#+begin_src emacs-lisp
(defun eshell-here ()
  "Opens up a new shell in the directory associated with the
    current buffer's file. The eshell is renamed to match that
    directory to make multiple eshell windows easier."
  (interactive)
  (let* ((height (/ (window-total-height) 3)))
    (split-window-vertically (- height))
    (other-window 1)
    (eshell "new")
    (insert (concat "ls"))
    (eshell-send-input)))
#+end_src

#+begin_src emacs-lisp
(defun what-is-my-ip ()
  (interactive)
  (message "IP: %s"
           (with-current-buffer (url-retrieve-synchronously "https://api.ipify.org")
             (buffer-substring (+ 1 url-http-end-of-headers) (point-max)))))
#+end_src

#+begin_src emacs-lisp
(defun what-the-commit ()
  (interactive)
  (insert
   (with-current-buffer
       (url-retrieve-synchronously "http://whatthecommit.com")
     (re-search-backward "<p>\\([^<]+\\)\n<\/p>")
     (match-string 1))))
#+end_src

* Acknowledgement
  My configuration is mainly based on many other peoples configuration. Thank
  you all for your work !

** Noteworthy configurations
* Before Startup
** Refresh packages
   #+begin_src emacs-lisp
     ;; (package-refresh-contents)
   #+end_src

   #+RESULTS:

** Define repos
  First i define the repos from where to download packages.
#+begin_src emacs-lisp
  (setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                           ("melpa" . "http://melpa.org/packages/")
                           ("org" . "http://orgmode.org/elpa/")))
#+end_src
** Install use-package
 If use-package isn't already installed, refresh contents and then install it so
 that the rest of the configuration is easier to maintain.

#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  ;; (use-package delight :ensure t)
  (use-package use-package-ensure-system-package :ensure t)
#+end_src

* General
** Better defaults

For a better user experience of GNU Emacs, here are the default values I use.

#+begin_src emacs-lisp
  (setq-default
   ad-redefinition-action 'accept                   ; Silence warnings for redefinition
   cursor-in-non-selected-windows t                 ; Hide the cursor in inactive windows
   display-time-default-load-average nil            ; Don't display load average
   fill-column 80                                   ; Set width for automatic line breaks
   help-window-select t                             ; Focus new help windows when opened
   indent-tabs-mode nil                             ; Prefers spaces over tabs
   inhibit-startup-screen t                         ; Disable start-up screen
   initial-scratch-message ""                       ; Empty the initial *scratch* buffer
   kill-ring-max 128                                ; Maximum length of kill ring
   load-prefer-newer t                              ; Prefers the newest version of a file
   mark-ring-max 128                                ; Maximum length of mark ring
   scroll-conservatively most-positive-fixnum       ; Always scroll by one line
   select-enable-clipboard t                        ; Merge system's and Emacs' clipboard
   tab-width 4                                      ; Set width for tabs
   use-package-always-ensure t                      ; Avoid the :ensure keyword for each package
   user-full-name "NICOLAS Clement"                 ; Set the full name of the current user
   user-mail-address "niccle27@gmail.com"           ; Set the email address of the current user
   vc-follow-symlinks t                             ; Always follow the symlinks
   view-read-only t)                                ; Always open read-only buffers in view-mode
  (cd "~/")                                         ; Move to the user directory
  (column-number-mode 1)                            ; Show the column number
  (set-fill-column 80)
  (display-time-mode 0)                             ; Enable time in the mode-line
  (fset 'yes-or-no-p 'y-or-n-p)                     ; Replace yes/no prompts with y/n
  (set-default-coding-systems 'utf-8)               ; Default to utf-8 encoding
  (show-paren-mode 1)                               ; Show the parent
  (global-display-line-numbers-mode)                ; Always display lines number
  (blink-cursor-mode 0)                             ; Disable Cursor Blinking
  (server-start)                                    ; Start emacs Server
  (set-face-attribute 'default nil :height 140)     ; Set fonts size
  (global-hl-line-mode)                             ; Hightlight current line
  (when window-system
      (menu-bar-mode 1)                             ; Disable the menu bar
      (scroll-bar-mode 1)                           ; Enable the scroll bar
      (tool-bar-mode -1)                            ; Disable the tool bar
      (tooltip-mode 1))                             ; Enable tooltips
#+end_src

** Navigation
*** Move-text
#+begin_src emacs-lisp
  (use-package move-text
    :bind (("M-p" . move-text-up)
	   ("M-n" . move-text-down))
    :config (move-text-default-bindings))
#+end_src

*** Evil
Evil is popular because Vi (and Vim) are popular. In fact, Vi (and
Vim) are more popular than Emacs itself. Emulation of Vi-style modal
editing for Emacs is provided by several various modes, but the most
advanced is Evil.
[[https://github.com/emacs-evil/evil][Evil]]
#+begin_src emacs-lisp :tangle yes

  (use-package evil
    :init
    (evil-mode 1)
    (setq evil-want-C-i-jump nil);disable the tab binding for evil-mode
  )

  (use-package evil-escape
    :after evil
    :init
    (evil-escape-mode 1)
    :bind
    (("M-A" . caps-lock-mode)))

#+end_src

*** Ace jump
Ace jump mode is a minor mode of emacs, which help you to move the cursor within Emacs. You can move your cursor to ANY position ( across window and frame ) in emacs by using only 3 times key press. Have a try and I am sure you will love it.

#+begin_src emacs-lisp :tangle yes
  (use-package ace-jump-mode)
  (define-key evil-normal-state-map (kbd "SPC") 'ace-jump-mode)
#+end_src

*** Smart move to beginning of the line

Navigation is an important part of productivity. The next function is a more
efficient way to go to the beginning of a line with =move-beginning-of-line=
(=C-a=) and =back-to-indentation= (=M-m=).

*FROM:*
http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/

#+begin_src emacs-lisp :tangle yes
  (defun my/smarter-move-beginning-of-line (arg)
    "Moves point back to indentation of beginning of line.

     Move point to the first non-whitespace character on this line.
     If point is already there, move to the beginning of the line.
     Effectively toggle between the first non-whitespace character and
     the beginning of the line.

     If ARG is not nil or 1, move forward ARG - 1 lines first. If
     point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (back-to-indentation)
      (when (= orig-point (point))
        (move-beginning-of-line 1))))

  (global-set-key (kbd "C-a") 'my/smarter-move-beginning-of-line)

#+end_src
*** TODO Imenu
Imenu produces menus for accessing locations in documents.
Currently not working
#+begin_src emacs-lisp
(use-package imenu
    :ensure nil
    :bind ("C-R" . imenu))
#+end_src
** Edition
*** Iedit
[[https://github.com/victorhge/iedit][Iedit]]
Edit multiple regions in the same way simultaneously

#+begin_src emacs-lisp :tangle yes
  (use-package iedit
    :ensure t
  :bind (("M-e" . iedit-mode)))
#+end_src

*** Expand-region
#+begin_src emacs-lisp :tangle yes
  (use-package expand-region
    :bind (("C-+" . er/contract-region)
           ("C-=" . er/expand-region)))
#+end_src

** Customization
*** Change custom file location
In order to keep the init.el file clean,we specify an other file which should be include as well for storing customization information.

#+begin_src emacs-lisp
    ;; (when (file-exists-p custom-file)
      ;; (load custom-file t))
  (setq custom-file "~/.emacs.d/custom.el")
#+end_src

#+RESULTS:
: ~/.emacs.d/custom.el

