config.org
*** Auto-revert
#+begin_src emacs-lisp
  (use-package autorevert
    :ensure nil
    :bind ("C-x R" . revert-buffer)
    :custom (auto-revert-verbose nil)
    :config (global-auto-revert-mode 1))
#+end_src

*** Parentheses
**** Color matching parentheses
#+begin_src emacs-lisp :tangle yes
  (use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :config
   (custom-set-faces
    '(rainbow-delimiters-depth-0-face ((t (:foreground "saddle brown"))))
    '(rainbow-delimiters-depth-1-face ((t (:foreground "dark orange"))))
    '(rainbow-delimiters-depth-2-face ((t (:foreground "deep pink"))))
    '(rainbow-delimiters-depth-3-face ((t (:foreground "chartreuse"))))
    '(rainbow-delimiters-depth-4-face ((t (:foreground "deep sky blue"))))
    '(rainbow-delimiters-depth-5-face ((t (:foreground "yellow"))))
    '(rainbow-delimiters-depth-6-face ((t (:foreground "orchid"))))
    '(rainbow-delimiters-depth-7-face ((t (:foreground "spring green"))))
    '(rainbow-delimiters-depth-8-face ((t (:foreground "sienna1"))))
    '(rainbow-delimiters-unmatched-face ((t (:foreground "black"))))))
#+end_src

**** Smart parentheses
#+begin_src emacs-lisp :tangle yes
  (use-package smartparens
    :defer 1
    :custom (sp-escape-quotes-after-insert nil)
    :config (smartparens-global-mode 1))
#+end_src

** Fonts
In order to use your favorite font.

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Source Code Pro")
  (set-fontset-font t 'latin "Noto Sans")
#+end_src

** Theme
I decided to go for the dracula theme because it's contrasted enough, but i
might change shortly

#+begin_src emacs-lisp
(use-package dracula-theme
  :config (load-theme 'dracula t)
  (set-face-background 'mode-line "#510370")
  (set-face-background 'mode-line-inactive "#212020"))
#+end_src

#+begin_src emacs-lisp
(require 'color)
(if (display-graphic-p)
    (set-face-attribute 'org-block nil :background
                        (color-darken-name
                         (face-attribute 'default :background) 10)))
#+end_src

*** Icons
#+begin_src emacs-lisp :tangle yes
  (use-package all-the-icons :defer 0.5)
#+end_src

** TODO LSP
Emacs is sometimes quite tricky to set up. In order to get some nice IDE features, i decided to go for an LSP client-server model.

** Typing
*** TODO Abbrev
    When taking some notes, abbreviation can save you some time.
#+begin_src emacs-lisp
  ;; (use-package abbrev
  ;;   :hook (text-mode . abbrev-mode)
  ;;   :config
  ;;   (load "~/.emacs.d/lisp/my-abbrev.el"))
#+end_src

#+RESULTS:
| flyspell-mode | abbrev-mode | my-turn-spell-checking-on | text-mode-hook-identify |

*** Spelling

**** Flyspell
Flyspell provides on-the-fly checking and highlighting of misspellings.
     #+begin_src emacs-lisp
  (use-package flyspell
    :hook ((markdown-mode org-mode text-mode) . flyspell-mode)
           (prog-mode . flyspell-prog-mode)
    :custom
    (flyspell-abbrev-p t)
    (flyspell-default-dictionary "en_US")
    (flyspell-issue-message-flag nil)
    (flyspell-issue-welcome-flag nil))

  (use-package flyspell-correct-ivy
    :after (flyspell ivy)
    :init (setq flyspell-correct-interface #'flyspell-correct-ivy))
#+end_src

**** Ispell
Handles spell-checking and correction.
Ensure to install the hunspell before using the package.
#+begin_src emacs-lisp
  (use-package ispell
  :defer 2
  :ensure-system-package (hunspell . "trizen -S hunspell")
  :custom
  (ispell-dictionary "en_US")
  (ispell-dictionary-alist
   '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)
     ("fr_BE" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "fr_BE") nil utf-8)))
  (ispell-program-name (executable-find "hunspell"))
  (ispell-really-hunspell t)
  (ispell-silently-savep t)
  :preface
  (defun my/switch-language ()
    "Switches between the English and French language."
    (interactive)
    (let* ((current-dictionary ispell-current-dictionary)
           (new-dictionary (if (string= current-dictionary "fr_BE") "en_US" "fr_BE")))
      (ispell-change-dictionary new-dictionary)
      (if (string= new-dictionary "fr_BE")
          (langtool-switch-default-language "fr")
        (langtool-switch-default-language "en"))

      ;;Clears all these old errors after switching to the new language
      (if (and (boundp 'flyspell-mode) flyspell-mode)
          (flyspell-mode 0)
        (flyspell-mode 1))

    (message "Dictionary switched from %s to %s" current-dictionary new-dictionary))))
#+end_src
**** TODO Grammar Checker
*** Lorem Ipsum
#+begin_src emacs-lisp :tangle yes
  (use-package lorem-ipsum
    :bind (("C-c C-v l" . lorem-ipsum-insert-list)
           ("C-c C-v p" . lorem-ipsum-insert-paragraphs)
           ("C-c C-v s" . lorem-ipsum-insert-sentences)))
#+end_src

** Interface Enhancement
*** Enhanced package manager
Replace the stock package list manager with a more modern one
#+begin_src emacs-lisp
(use-package paradox
  :custom
  (paradox-execute-asynchronously t)
  :config
  (paradox-enable))
#+end_src

*** Which-key
#+begin_src emacs-lisp :tangle yes
  (use-package which-key
    :defer 0.2
    :config (which-key-mode)
    :bind
    ("<f5>" . which-key-show-top-level))
#+end_src

