config.org
**** TODO Password
#+begin_src emacs-lisp
  ;; (use-package ivy-pass
  ;;   :after ivy
  ;;   :commands ivy-pass)
#+end_src

*** Reserch and Replace
#+begin_src emacs-lisp
    (use-package swiper
      :after ivy
      :bind (("C-s" . swiper)
             :map swiper-map
             ("M-%" . swiper-query-replace)))

#+end_src
*** PDF
#+begin_src emacs-lisp :tangle yes
  (use-package pdf-tools
    :defer 1
    :magic ("%PDF" . pdf-view-mode)
    :init (pdf-tools-install :no-query))

  (use-package pdf-view
    :ensure nil
    :after pdf-tools
    :bind (:map pdf-view-mode-map
                ("C-s" . isearch-forward)
                ("d" . pdf-annot-delete)
                ("h" . pdf-annot-add-highlight-markup-annotation)
                ("t" . pdf-annot-add-text-annotation))
    :custom
    (pdf-view-display-size 'fit-page)
    (pdf-view-resize-factor 1.1)
    (pdf-view-use-unicode-ligther nil))
#+end_src

** Projects
*** Projectile

#+begin_src emacs-lisp :tangle yes
  (use-package projectile
    :defer 1
    :preface
    (defun my/projectile-compilation-buffers (&optional project)
      "Get a list of a project's compilation buffers.
    If PROJECT is not specified the command acts on the current project."
      (let* ((project-root (or project (projectile-project-root)))
             (buffer-list (mapcar #'process-buffer compilation-in-progress))
             (all-buffers (cl-remove-if-not
                           (lambda (buffer)
                             (projectile-project-buffer-p buffer project-root))
                           buffer-list)))
        (if projectile-buffers-filter-function
            (funcall projectile-buffers-filter-function all-buffers)
          all-buffers)))
    :custom
    (projectile-completion-system 'ivy)
    (projectile-enable-caching t)
    (projectile-keymap-prefix (kbd "C-c C-p"))
    (projectile-mode-line '(:eval (projectile-project-name)))
    :config (projectile-global-mode))

  (use-package counsel-projectile
    :after (counsel projectile)
    :config (counsel-projectile-mode 1))
#+end_src

*** Version Control
**** TODO Magit
#+begin_src emacs-lisp
  (use-package magit :defer 0.3)
#+end_src

**** TODO Git-commit
Must look whether i'm gonna used this or not
#+begin_src emacs-lisp
  ;; (use-package git-commit
  ;;   :after magit
  ;;   :hook (git-commit-mode . my/git-commit-auto-fill-everywhere)
  ;;   :custom (git-commit-summary-max-length 50)
  ;;   :preface
  ;;   (defun my/git-commit-auto-fill-everywhere ()
  ;;     "Ensures that the commit body does not exceed 72 characters."
  ;;     (setq fill-column 72)
  ;;     (setq-local comment-auto-fill-only-comments nil)))
#+end_src

**** TODO Smerge-mode
#+begin_src emacs-lisp
(use-package smerge-mode
    :after hydra
    :hook (magit-diff-visit-file . (lambda ()
                                     (when smerge-mode
                                       (hydra-merge/body)))))
#+end_src

**** TODO Forge
Usefull to connect to some git forge like github, gitlab... from the comfort of Magit.
#+begin_src emacs-lisp
(use-package forge)
#+end_src

**** Git-gutter
Show add, modification, delete on the side of a versioned file
#+begin_src emacs-lisp
 (use-package git-gutter
    :defer 0.3
    :init (global-git-gutter-mode ))
#+end_src

**** Git-timemachine
#+begin_src emacs-lisp :tangle yes
  (use-package git-timemachine
    :defer 1)
#+end_src

** File Manager
*** Ranger
[[https://github.com/ralesi/ranger.el][Ranger]]
This is a minor mode that runs within dired, it emulates many
of ranger's features
#+begin_src emacs-lisp :tangle yes
  (use-package ranger
    :bind ("C-c b" . ranger)
    :custom
    (ranger-preview-file 1))
#+end_src

* Programming languages
** General programming settings

*** EditorConfig
#+begin_src emacs-lisp
(use-package editorconfig
  :defer 0.3
  :config (editorconfig-mode 1))
#+end_src

*** Aggressive-indent
#+begin_src emacs-lisp
  (use-package aggressive-indent
    :hook ((css-mode . aggressive-indent-mode)
           (emacs-lisp-mode . aggressive-indent-mode)
           (js-mode . aggressive-indent-mode)
           (lisp-mode . aggressive-indent-mode))
    :custom (aggressive-indent-comments-too))
#+end_src

*** Electric-operator
Add some spaces around operators
#+begin_src emacs-lisp
  (use-package electric-operator
    ;; :hook (python-mode . electric-operator-mode)
    :config (electric-operator-mode 1))
#+end_src

*** Rainbow-mode
Colorize colors as text with their value.
#+begin_src emacs-lisp
  (use-package rainbow-mode
    :hook (prog-mode))
#+end_src

*** Whitespaces deletion
#+begin_src emacs-lisp :tangle yes
  (use-package simple
    :ensure nil
    :hook (before-save . delete-trailing-whitespace))
#+end_src

*** Hungry-delete
#+begin_src emacs-lisp :tangle yes
  (use-package hungry-delete
    :defer 0.7
    :config (global-hungry-delete-mode))
#+end_src

** Web-mode
#+begin_src emacs-lisp
(use-package web-mode
  :mode "\\.phtml\\'"
  :mode "\\.volt\\'"
  :mode "\\.html\\'"
  :mode "\\.svelte\\'"
  :config
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-css-indent-offset 2))
#+end_src

** Emmet-mode
#+begin_src emacs-lisp
(use-package emmet-mode
  :config
  (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
  (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
  )
#+end_src

** TODO Linters
* Org-Mode
* Advanced configurations
** Alert

Most packages use =alerts= to make notifications with =libnotify=. Don't forget
to first install a notification daemon, like =dunst=.

#+BEGIN_QUOTE
Alert is a Growl-workalike for Emacs which uses a common notification interface
and multiple, selectable "styles", whose use is fully customizable by the user.

[[https://github.com/jwiegley/alert][John Wiegley]]
#+END_QUOTE

#+begin_src emacs-lisp
  (use-package alert
    :defer 1
    :custom (alert-default-style 'libnotify))
#+end_src

** Auto-Completion
As a completion package, i'm using company with several other packages to rice it.
*** Company
#+begin_src emacs-lisp
  (use-package company
    :diminish company-mode
    :config
    (add-hook 'after-init-hook 'global-company-mode)
    (setq company-minimum-prefix-length 2)
    (setq company-dabbrev-downcase nil)
    (setq company-begin-commands '(self-insert-command))
    (setq company-idle-delay .1)
    (setq company-minimum-prefix-length 2)
    (setq company-show-numbers t)
    (setq company-tooltip-align-annotations 't)
    (bind-keys :map company-active-map
           ("C-d" . company-show-doc-buffer)
           ("C-l" . company-show-location)
           ("C-n" . company-select-next)
           ("C-p" . company-select-previous)
           ("TAB" . company-complete)))
#+end_src

#+RESULTS:
: t

*** Company-go
#+begin_quote
Completion will start automatically whenever the current symbol is preceded by a ., or after you type company-minimum-prefix-length letters.
#+end_quote
#+begin_src emacs-lisp
(use-package company-go)
#+end_src

#+RESULTS:

*** Company-box
#+begin_quote
A company front-end with icons.
#+end_quote
#+begin_src emacs-lisp
(use-package company-box
    :after company
    :hook (company-mode . company-box-mode))
#+end_src

#+RESULTS:
| company-box-mode | company-mode-set-explicitly |

** External Launch
*** Browser
**** Default launcher
#+begin_src emacs-lisp
  (use-package browse-url
    :ensure nil
    :custom
    (browse-url-browser-function 'browse-url-generic)
    (browse-url-generic-program "qutebrowser"))
#+end_src

**** Launch specific search from emacs
#+begin_src emacs-lisp
  (use-package engine-mode
    :defer 3
    :config
    (defengine amazon
      "http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=%s"
      :keybinding "a")

    (defengine duckduckgo
      "https://duckduckgo.com/?q=%s"
      :keybinding "d")

    (defengine github
      "https://github.com/search?ref=simplesearch&q=%s"
      :keybinding "g")

    (defengine google-images
      "http://www.google.com/images?hl=en&source=hp&biw=1440&bih=795&gbv=2&aq=f&aqi=&aql=&oq=&q=%s"
      :keybinding "i")

    (defengine google-maps
      "http://maps.google.com/maps?q=%s"
      :keybinding "m"
      :docstring "Mappin' it up.")

    (defengine stack-overflow
      "https://stackoverflow.com/search?q=%s"
      :keybinding "s")

    (defengine youtube
      "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
      :keybinding "y")

    (defengine wikipedia
      "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
      :keybinding "w"
      :docstring "Searchin' the wikis.")
    (engine-mode t))
#+end_src

** Buffer
*** Ibuffer
#+begin_src emacs-lisp
  (use-package ibuffer
      :bind ("C-x C-b" . ibuffer))
  (use-package ibuffer-vc
    :after ibuffer)
  (use-package ibuffer-git
    :after ibuffer)
#+end_src

#+RESULTS:
*** Protection against deletion

#+begin_src emacs-lisp
  (when (get-buffer "*scratch*")
  (with-current-buffer "*scratch*"
	    (emacs-lock-mode 'kill)))

  (when (get-buffer "*dashboard*")
  (with-current-buffer "*dashboard*"
	    (emacs-lock-mode 'kill)))

  (when (get-buffer "*Backtrace*")
  (with-current-buffer "*Backtrace*"
	    (emacs-lock-mode 'kill)))

  (when (get-buffer "*Messages*")
  (with-current-buffer "*Messages*"
	    (emacs-lock-mode 'kill)))
#+end_src
#+RESULTS:
: kill
